In [2]:
import pandas as pd
import pyodbc

In [3]:
server = "localhost"
database = "cars_2021"
username = "xxxx"
password = "xxxx"

connection = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};SERVER="
    + server
    + ";DATABASE="
    + database
    + ";UID="
    + username
    + ";PWD="
    + password
)

def exec_query(query:str) -> pd.DataFrame:
    return pd.read_sql_query(query, connection)

In [7]:
model_name = "yukon"

car_gen_df = exec_query(f"""select
	model.name as model_name,
	gen.name as gen_name,
	gen.year_begin,
	gen.year_end,
	gen.id_car_generation
from car_generation gen
inner join car_model model
on gen.id_car_model = model.id_car_model
where model.name like '%{model_name}%'
order by gen.year_end desc, gen.year_begin desc""")


car_gen_df

  model_name               gen_name year_begin year_end  id_car_generation
0      Yukon           5 generation       2020     2021             128044
1      Yukon           4 generation       2014     2021             124266
2      Yukon                 GMT900       2006     2014                724
3      Yukon                 GMT800       2000     2006                725
4      Yukon  1 generation (GMT400)       1992     1999               8061

In [15]:
exec_query("select * from car_serie where id_car_generation = 128044")

Empty DataFrame
Columns: [id_car_serie, id_car_model, id_car_generation, name, date_create, date_update, id_car_type]
Index: []

In [13]:
exec_query("select * from car_trim where id_car_serie = 64926")

,id_car_trim,id_car_serie,id_car_model,name,start_production_year,end_production_year,date_create,date_update,id_car_type
0,258263,64926,708,5.3 AT (355 hp),None,None,1598046841,1598046841,1
1,258264,64926,708,5.3 AT 4WD (355 hp),None,None,1598046841,1598046841,1
2,258265,64926,708,6.2 AT (420 hp),None,None,1598046841,1598046841,1
3,258266,64926,708,6.2 AT 4WD (420 hp),None,None,1598046841,1598046841,1

In [14]:
exec_query("select * from car_trim where id_car_model = 708")

,id_car_trim,id_car_serie,id_car_model,name,start_production_year,end_production_year,date_create,date_update,id_car_type
0,17869,3396,708,5.3 AT XL 4WD (324 hp),2014.0,NaN,1402293380,1534983551,1
1,17870,3396,708,5.3 AT (320 hp),2014.0,NaN,1402293380,1534983552,1
2,17871,3396,708,6.2 AT (385 hp),2014.0,NaN,1402293380,1534983558,1
3,17872,3396,708,6.2 AT 4WD (385 hp),2014.0,NaN,1402293380,1534983558,1
4,32263,6251,708,XL 2500 6.0 AT (304 hp) 4WD,2000.0,2006.0,1402948524,1455679903,1
...,...,...,...,...,...,...,...,...,...
62,268804,67436,708,3.0 AT 4WD (282 hp),NaN,NaN,1626881762,1626881762,1
63,268805,67436,708,5.3 AT (360 hp),NaN,NaN,1626881762,1626881762,1
64,268806,67436,708,5.3 AT 4WD (360 hp),NaN,NaN,1626881762,1626881762,1
65,268807,67436,708,6.2 AT (426 hp),NaN,NaN,1626881762,1626881762,1
66,268808,67436,708,6.2 AT 4WD (426 hp),NaN,NaN,1626881762,1626881762,1